"""Underhood constants and configurations."""
from dataclasses import dataclass
from datetime import timedelta


@dataclass(frozen=True)
class LocalConfig:  # 🇷🇺
    """Underhood language configuration."""

    week_title: str = "Архив недели"
    links_title: str = "Ссылки"
    thread: str = "Тред"
    thread_count: int = 4
    days: tuple[str, ...] = (
        "Понедельник",
        "Вторник",
        "Среда",
        "Четверг",
        "Пятница",
        "Суббота",
        "Воскресенье",
    )
    week_uploaded: str = "😎 Вся прошлая неделя выгружена в архив!"
    td = timedelta(hours=3)
    spacy_model = "ru_core_news_sm"
    topics: int = 6
    stopwords: tuple[str, ...] = (
        "особо",
        "достаточно",
        "могу",
        "далее" "которую",
        "какие",
        "будут",
        "конечно",
        "каком",
        "например",
        "также",
        "том",
        "и",
        "то",
        "того",
        "расскажу",
        "что",
        "это",
        "так",
        "вот",
        "быть",
        "как",
        "в",
        "—",
        "к",
        "на",
        "эту",
        "эта",
        "всем",
        "привет",
        "кого",
        "пока",
        "обо",
        "просто",
        "очень",
        "которые",
        "просто",
        "поэтому",
        "что",
        "то",
        "например",
        "прямо",
        "все",
        "еще",
        "вообще",
        "делать",
        "которые",
        "что",
        "еще",
        "то",
        "вообще",
        "поэтому",
        "делать",
        "просто",
        "например",
        "прямо",
        "все",
        "очень",
        "еще",
        "--",
        "разумеется",
        "всё",
        "ещё",
        "вот",
        "что-то",
        "–",
        "____",
        ":-)",
        ":)",
        "...",
        ";)",
        "=)",
        "короче",
        "норм",
        "нам",
        "нужно",
        "•",
        "сих",
        "из-за",
        "кажется",
        "кстати",
        "её",
        "этих",
        "ктото",
        "of",
        "обычно",
    )


LOCALE = LocalConfig()
IMAGE_FORMATS = (".png", ".jpg", ".jpeg")
